src/test/java/mercadopago/v2/mock/response/payment/by_external_reference.json

{
  "paging": {
    "total": 1,
    "limit": 30,
    "offset": 0
  },
  "results": [
    {
      "metadata": {
        "order_number": "order_1631894348"
      },
      "corporation_id": null,
      "operation_type": "regular_payment",
      "point_of_interaction": {},
      "fee_details": [
        {
          "amount": 0.62,
          "fee_payer": "collector",
          "type": "mercadopago_fee"
        }
      ],
      "notification_url": "https://seu-site.com.br/webhookshttps://seu-site.com.br/webhooks",
      "date_approved": "2021-09-17T11:59:11.000-04:00",
      "money_release_schema": null,
      "payer": {
        "entity_type": null,
        "identification": {
          "number": "19119119100",
          "type": "CPF"
        },
        "phone": {
          "number": null,
          "extension": null,
          "area_code": null
        },
        "operator_id": null,
        "last_name": "Silva",
        "id": "128185910",
        "type": "anonymous",
        "first_name": "Joao",
        "email": "test_user_1631894348@testuser.com"
      },
      "transaction_details": {
        "total_paid_amount": 12.34,
        "acquirer_reference": null,
        "installment_amount": 12.34,
        "financial_institution": null,
        "net_received_amount": 11.72,
        "overpaid_amount": 0,
        "external_resource_url": null,
        "payable_deferral_period": null,
        "payment_method_reference_id": null
      },
      "statement_descriptor": "Mercadopago*fake",
      "call_for_authorize_id": null,
      "installments": 1,
      "pos_id": null,
      "external_reference": "1631894348",
      "date_of_expiration": null,
      "charges_details": [],
      "id": 17014025134,
      "payment_type_id": "credit_card",
      "order": {},
      "counter_currency": null,
      "brand_id": null,
      "status_detail": "accredited",
      "differential_pricing_id": null,
      "additional_info": {
        "authentication_code": null,
        "nsu_processadora": null,
        "available_balance": null,
        "items": [
          {
            "quantity": "1",
            "category_id": "Tickets",
            "picture_url": null,
            "description": "Natal Iluminado 2019",
            "id": "1941",
            "title": "Ingresso Antecipado",
            "unit_price": "100.0"
          }
        ],
        "payer": {
          "address": {
            "street_number": "3003",
            "street_name": "Av. das Nações Unidas",
            "zip_code": "06233-200"
          },
          "registration_date": "2013-08-06T09:25:04.000-03:00"
        },
        "shipments": {
          "receiver_address": {
            "street_number": "15",
            "street_name": "são Luiz",
            "zip_code": "95630000"
          }
        }
      },
      "live_mode": true,
      "marketplace_owner": null,
      "card": {
        "first_six_digits": "503143",
        "expiration_year": 2022,
        "date_created": "2021-09-17T11:59:10.000-04:00",
        "expiration_month": 12,
        "id": null,
        "cardholder": {
          "identification": {
            "number": "19119119100",
            "type": "CPF"
          },
          "name": "APRO"
        },
        "last_four_digits": "6351",
        "date_last_updated": "2021-09-17T11:59:10.000-04:00"
      },
      "integrator_id": null,
      "status": "approved",
      "transaction_amount_refunded": 0,
      "transaction_amount": 12.34,
      "description": "PEDIDO NOVO - VIDEOGAME",
      "money_release_date": "2021-09-17T11:59:11.000-04:00",
      "merchant_number": null,
      "refunds": [],
      "authorization_code": "301299",
      "captured": true,
      "collector_id": 810882223,
      "merchant_account_id": null,
      "taxes_amount": 0,
      "date_last_updated": "2021-09-17T11:59:11.000-04:00",
      "coupon_amount": 0,
      "store_id": null,
      "date_created": "2021-09-17T11:59:10.000-04:00",
      "acquirer_reconciliation": [],
      "sponsor_id": null,
      "shipping_amount": 0,
      "issuer_id": "24",
      "payment_method_id": "master",
      "binary_mode": false,
      "platform_id": null,
      "deduction_schema": null,
      "processing_mode": "aggregator",
      "currency_id": "BRL",
      "shipping_cost": 0
    }
  ]
}